Tekla Open API Reference for Tekla Structures 2025
Picker.PickObject Method (String, DrawingObject, ViewBase, Point)
 Requests the user to pick one object. Returns the picked point in addition to the picked object.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void PickObject(
	string prompt,
	out DrawingObject pickedObject,
	out ViewBase pickedView,
	out Point pickedPoint
)
Public Sub PickObject (
	prompt As String,
	<OutAttribute> ByRef pickedObject As DrawingObject,
	<OutAttribute> ByRef pickedView As ViewBase,
	<OutAttribute> ByRef pickedPoint As Point
)
Parameters
prompt
Type: System.String
The prompt shown in the status bar before the picks. See the class remarks for more information about prompts.
pickedObject
Type: Tekla.Structures.Drawing.DrawingObject
The picked drawing object.
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
pickedPoint
Type: Tekla.Structures.Geometry3d.Point
The picked point in the view coordinates.
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
PickObject Overload
Tekla.Structures.Drawing.UI Namespace